In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [ ]:
%%sql
#1. First Normal Form (1NF)
#Definition & Purpose (1NF)
#1NF requires that every column holds only atomic (indivisible) values and that there are no repeating groups.
#Purpose: To ensure each field contains a single piece of data.

In [5]:
%%sql
#Before 
#Non-1NF Table: contains multi-valued phone_numbers in a single column
Drop table if exists Students_Non1NF;
CREATE TABLE Students_Non1NF (
    student_id   INT,
    student_name VARCHAR(100),
    phone_numbers VARCHAR(100)  -- e.g., '123-4567,987-6543'
);

# Sample data insertion (non-atomic phone numbers)
INSERT INTO Students_Non1NF (student_id, student_name, phone_numbers)
VALUES (1, 'Alice', '123-4567,987-6543'),
       (2, 'Bob', '555-1212');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
2 rows affected.

[]

In [6]:
%%sql
Select * from students_non1NF

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(1, 'Alice', '123-4567,987-6543'), (2, 'Bob', '555-1212')]

In [7]:
%%sql
#After 

-- Main Students table with atomic values
drop table if exists students;
CREATE TABLE Students (
    student_id   INT PRIMARY KEY,
    student_name VARCHAR(100)
);

-- Separate table for phone numbers, ensuring each phone number is atomic
drop table if exists studentsphones;
CREATE TABLE StudentPhones (
    student_id INT,
    phone      VARCHAR(20),
    PRIMARY KEY (student_id, phone),
    FOREIGN KEY (student_id) REFERENCES Students(student_id)
);

-- Insert students
INSERT INTO Students (student_id, student_name)
VALUES (1, 'Alice'),
       (2, 'Bob');

-- Insert phone numbers (each phone number in its own row)
INSERT INTO StudentPhones (student_id, phone)
VALUES (1, '123-4567'),
       (1, '987-6543'),
       (2, '555-1212');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
2 rows affected.
3 rows affected.

[]

In [8]:
%%sql
select * from students;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(1, 'Alice'), (2, 'Bob')]

In [10]:
%%sql
select * from studentphones;

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, '123-4567'), (1, '987-6543'), (2, '555-1212')]

In [11]:
%%sql
#By doing this way we can able to stop the repeatdency and we full fill the Normal Form 1

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [12]:
%%sql
#2. Second Normal Form (2NF)
#Definition & Purpose (2NF)
#2NF requires the table to be in 1NF and that all non-key columns are fully functionally dependent on the entire primary key.
#Purpose: To remove partial dependencies (where a column depends on only part of a composite key).
#Ella columns um primary key ah depend panni irukanom athuku peru fully dependencies, appdi illa nah adhuku peru the partial dependencies aatha tha inga full fill panna porom NF2 la

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [13]:
%%sql
#Before 
-- This table is in 1NF but not in 2NF because course details depend only on course_id.
drop table if exists Enrollment_Non2NF;
CREATE TABLE Enrollment_Non2NF (
    student_id  INT,
    course_id   INT,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    PRIMARY KEY (student_id, course_id)
);

-- Sample data insertion
INSERT INTO Enrollment_Non2NF (student_id, course_id, course_name, instructor)
VALUES (1, 101, 'Intro to SQL', 'Dr. Smith'),
       (2, 101, 'Intro to SQL', 'Dr. Smith'),
       (1, 102, 'Database Design', 'Dr. Jones');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
3 rows affected.

[]

In [14]:
%%sql
select * from Enrollment_Non2NF;
# Here the studentid and courseid is primary but the instructor and course name is based on course id but not depended on student id this is called as 
# partial dependeicies, so we have to break the table into two and then full fill the 2NF.

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 101, 'Intro to SQL', 'Dr. Smith'),
 (1, 102, 'Database Design', 'Dr. Jones'),
 (2, 101, 'Intro to SQL', 'Dr. Smith')]

In [21]:
%%sql
# After 
drop table if exists enrollment;
drop table if exists course;
-- Table holding course details
CREATE TABLE Course (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100)
);

-- Table recording enrollments (relationship)

CREATE TABLE Enrollment (
    student_id INT,
    course_id  INT,
    PRIMARY KEY (student_id, course_id),
    FOREIGN KEY (course_id) REFERENCES Course(course_id)
);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [22]:
%%sql
-- Insert course details
INSERT INTO Course (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

-- Insert enrollment data
INSERT INTO Enrollment (student_id, course_id)
VALUES (1, 101),
       (2, 101),
       (1, 102);

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.
3 rows affected.

[]

In [23]:
%%sql
select * from course;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith'), (102, 'Database Design', 'Dr. Jones')]

In [24]:
%%sql
select * from Enrollment;

 * mysql+mysqlconnector://root:***@localhost/mydb
3 rows affected.

[(1, 101), (2, 101), (1, 102)]

In [25]:
%%sql
# Here we solved the problem we had by doing the NF2, Now everything is connected to the primary key none of them are partial dependiences

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [26]:
%%sql
#3. Third Normal Form (3NF)
#Definition & Purpose (3NF)
#3NF requires that the table is in 2NF and that all the columns are directly dependent on the primary key 
#(i.e., no transitive dependencies).
#Purpose: To remove transitive dependencies where a non-key column depends on another non-key column.
# Simple ah sollanom nah NF2 vanthu ellamey primary key ah depend panni irukanom nu but 3NF edhuku nah entha colum um non-key ah depend panni iruka
#kudathu nu. Non key nah primary key ah illama iruka key.

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [27]:
%%sql
#Before

-- This table is in 2NF but has a transitive dependency:
drop table if exists Courses_Non3NF;
CREATE TABLE Courses_Non3NF (
    course_id        INT PRIMARY KEY,
    course_name      VARCHAR(100),
    instructor       VARCHAR(100),
    instructor_office VARCHAR(100)
);

-- Sample data insertion
INSERT INTO Courses_Non3NF (course_id, course_name, instructor, instructor_office)
VALUES (101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
       (102, 'Database Design', 'Dr. Jones', 'Room 102');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
2 rows affected.

[]

In [29]:
%%sql
# Here the instructor_office column is depend on the non key column instructor so we need to change that 
select * from Courses_Non3NF;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith', 'Room 101'),
 (102, 'Database Design', 'Dr. Jones', 'Room 102')]

In [41]:
%%sql
#After 
drop table if exists courses;
drop table if exists instructors;


-- New table for instructor details
CREATE TABLE Instructors (
    instructor       VARCHAR(100) PRIMARY KEY,
    instructor_office VARCHAR(100)
);

-- Insert instructor details
INSERT INTO Instructors (instructor, instructor_office)
VALUES ('Dr. Smith', 'Room 101'),
       ('Dr. Jones', 'Room 102');

-- Revised Courses table (now 3NF): holds course-specific data
CREATE TABLE Courses (
    course_id   INT PRIMARY KEY,
    course_name VARCHAR(100),
    instructor  VARCHAR(100),
    FOREIGN KEY (instructor) REFERENCES Instructors(instructor)
);

-- Insert courses with reference to instructors
INSERT INTO Courses (course_id, course_name, instructor)
VALUES (101, 'Intro to SQL', 'Dr. Smith'),
       (102, 'Database Design', 'Dr. Jones');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
0 rows affected.
2 rows affected.
0 rows affected.
2 rows affected.

[]

In [42]:
%%sql
select * from courses;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(101, 'Intro to SQL', 'Dr. Smith'), (102, 'Database Design', 'Dr. Jones')]

In [43]:
%%sql
Select * from Instructors;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[('Dr. Jones', 'Room 102'), ('Dr. Smith', 'Room 101')]